Revit 2027 API
ViewSchedule.IsInternalKeynoteSchedule Property
 Identifies if this ViewSchedule is an internal schedule used when keynotes are filtered based on the elements that are shown on a sheet.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsInternalKeynoteSchedule { get; }
Public ReadOnly Property IsInternalKeynoteSchedule As Boolean
	Get
public:
property bool IsInternalKeynoteSchedule {
	bool get ();
}
member IsInternalKeynoteSchedule : bool with get
Property Value
Boolean
Remarks
 These schedules cannot be modified by the user or placed on sheets.
See Also
Reference
ViewSchedule Class
Autodesk.Revit.DB Namespace